GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3m(e)xx-pinctrl.h
/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)
#define TIMER2_CH0_PE2 \
	GD32_PINMUX_AF('E', 2, AF2)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)
#define TIMER2_CH1_PE3 \
	GD32_PINMUX_AF('E', 3, AF2)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)
#define TIMER2_CH2_PE4 \
	GD32_PINMUX_AF('E', 4, AF2)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER2_CH3_PB7 \
	GD32_PINMUX_AF('B', 7, AF10)
#define TIMER2_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)
#define TIMER2_CH3_PE5 \
	GD32_PINMUX_AF('E', 5, AF2)

/* TIMER2_ETI */
#define TIMER2_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF10)
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AF('D', 2, AF2)

/* TIMER3_CH0 */
#define TIMER3_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF10)
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)
#define TIMER3_CH0_PD12 \
	GD32_PINMUX_AF('D', 12, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF10)
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)
#define TIMER3_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PA13 \
	GD32_PINMUX_AF('A', 13, AF10)
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)
#define TIMER3_CH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)
#define TIMER3_CH3_PD15 \
	GD32_PINMUX_AF('D', 15, AF2)

/* TIMER3_ETI */
#define TIMER3_ETI_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)
#define TIMER3_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF2)
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AF('E', 0, AF2)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER4_CH0_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER4_CH1_PC12 \
	GD32_PINMUX_AF('C', 12, AF1)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER4_CH3_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)

/* TIMER4_ETI */
#define TIMER4_ETI_PB12 \
	GD32_PINMUX_AF('B', 12, AF2)
#define TIMER4_ETI_PD11 \
	GD32_PINMUX_AF('D', 11, AF1)

/* TIMER7_BRKIN0 */
#define TIMER7_BRKIN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF9)
#define TIMER7_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)
#define TIMER7_BRKIN0_PA10 \
	GD32_PINMUX_AF('A', 10, AF11)
#define TIMER7_BRKIN0_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)
#define TIMER7_BRKIN0_PD2 \
	GD32_PINMUX_AF('D', 2, AF4)

/* TIMER7_BRKIN1 */
#define TIMER7_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF6)

/* TIMER7_BRKIN2 */
#define TIMER7_BRKIN2_PB6 \
	GD32_PINMUX_AF('B', 6, AF10)
#define TIMER7_BRKIN2_PC9 \
	GD32_PINMUX_AF('C', 9, AF6)
#define TIMER7_BRKIN2_PD1 \
	GD32_PINMUX_AF('D', 1, AF6)

/* TIMER7_CH0 */
#define TIMER7_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF3)
#define TIMER7_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF4)

/* TIMER7_CH1 */
#define TIMER7_CH1_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define TIMER7_CH1_PB8 \
	GD32_PINMUX_AF('B', 8, AF10)
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF4)

/* TIMER7_CH2 */
#define TIMER7_CH2_PB9 \
	GD32_PINMUX_AF('B', 9, AF10)
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF4)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF4)
#define TIMER7_CH3_PD1 \
	GD32_PINMUX_AF('D', 1, AF4)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF10)
#define TIMER7_ETI_PB6 \
	GD32_PINMUX_AF('B', 6, AF6)

/* TIMER7_MCH0 */
#define TIMER7_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF4)
#define TIMER7_MCH0_PB3 \
	GD32_PINMUX_AF('B', 3, AF4)
#define TIMER7_MCH0_PC10 \
	GD32_PINMUX_AF('C', 10, AF4)

/* TIMER7_MCH1 */
#define TIMER7_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF4)
#define TIMER7_MCH1_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)
#define TIMER7_MCH1_PC11 \
	GD32_PINMUX_AF('C', 11, AF4)

/* TIMER7_MCH2 */
#define TIMER7_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF4)
#define TIMER7_MCH2_PB5 \
	GD32_PINMUX_AF('B', 5, AF3)
#define TIMER7_MCH2_PC12 \
	GD32_PINMUX_AF('C', 12, AF4)

/* TIMER7_MCH3 */
#define TIMER7_MCH3_PC13 \
	GD32_PINMUX_AF('C', 13, AF6)
#define TIMER7_MCH3_PD0 \
	GD32_PINMUX_AF('D', 0, AF6)

/* TRIGSEL_IN0 */
#define TRIGSEL_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF13)

/* TRIGSEL_IN1 */
#define TRIGSEL_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, AF13)

/* TRIGSEL_IN10 */
#define TRIGSEL_IN10_PA13 \
	GD32_PINMUX_AF('A', 13, AF13)

/* TRIGSEL_IN11 */
#define TRIGSEL_IN11_PA14 \
	GD32_PINMUX_AF('A', 14, AF13)

/* TRIGSEL_IN12 */
#define TRIGSEL_IN12_PA10 \
	GD32_PINMUX_AF('A', 10, AF14)
#define TRIGSEL_IN12_PA12 \
	GD32_PINMUX_AF('A', 12, AF13)

/* TRIGSEL_IN13 */
#define TRIGSEL_IN13_PA9 \
	GD32_PINMUX_AF('A', 9, AF14)
#define TRIGSEL_IN13_PA11 \
	GD32_PINMUX_AF('A', 11, AF13)

/* TRIGSEL_IN2 */
#define TRIGSEL_IN2_PC2 \
	GD32_PINMUX_AF('C', 2, AF13)

/* TRIGSEL_IN3 */
#define TRIGSEL_IN3_PD0 \
	GD32_PINMUX_AF('D', 0, AF13)

/* TRIGSEL_IN4 */
#define TRIGSEL_IN4_PA3 \
	GD32_PINMUX_AF('A', 3, AF13)

/* TRIGSEL_IN5 */
#define TRIGSEL_IN5_PA7 \
	GD32_PINMUX_AF('A', 7, AF13)

/* TRIGSEL_IN6 */
#define TRIGSEL_IN6_PD1 \
	GD32_PINMUX_AF('D', 1, AF13)

/* TRIGSEL_IN7 */
#define TRIGSEL_IN7_PA2 \
	GD32_PINMUX_AF('A', 2, AF13)

/* TRIGSEL_IN8 */
#define TRIGSEL_IN8_PC0 \
	GD32_PINMUX_AF('C', 0, AF13)

/* TRIGSEL_IN9 */
#define TRIGSEL_IN9_PC1 \
	GD32_PINMUX_AF('C', 1, AF13)

/* TRIGSEL_OUT0 */
#define TRIGSEL_OUT0_PA15 \
	GD32_PINMUX_AF('A', 15, AF12)

/* TRIGSEL_OUT1 */
#define TRIGSEL_OUT1_PB14 \
	GD32_PINMUX_AF('B', 14, AF14)

/* TRIGSEL_OUT2 */
#define TRIGSEL_OUT2_PB10 \
	GD32_PINMUX_AF('B', 10, AF14)

/* TRIGSEL_OUT3 */
#define TRIGSEL_OUT3_PB0 \
	GD32_PINMUX_AF('B', 0, AF12)

/* TRIGSEL_OUT4 */
#define TRIGSEL_OUT4_PB1 \
	GD32_PINMUX_AF('B', 1, AF12)

/* TRIGSEL_OUT5 */
#define TRIGSEL_OUT5_PB15 \
	GD32_PINMUX_AF('B', 15, AF14)

/* TRIGSEL_OUT6 */
#define TRIGSEL_OUT6_PB4 \
	GD32_PINMUX_AF('B', 4, AF14)

